# Напишите функцию, которая проверяет:
# является ли слово палиндромом

def palindrom(x):
    if x[::-1] == x:
        print ('Это палиндром')
    else:
        print('Это не палиндром')

x = input("Введите пожалуйста слово: ")
palindrom(x)


